import math
# нужен для числа Пи
rc=input("Введите радиус круга в сантиметрах ")
print('')
# Для удобности в чтении после каждой конкретной задачи в лабораторной работе я буду ставить обзацы
Pi=math.pi
# Записываю число Пи на отдельную переменную для упрощения записи
rc=float(rc)
# Перевожу введёную строку в число
dc=rc*Pi*2
sc=rc*rc*Pi
print(f"Длинна окружности {int(dc/100)} м {int(dc%100)} см, площадь круга {int(sc/10000)} м² {int(sc%100)} см²")
# Округления и переводы всего числа в метры и сантиметры я буду делать прямо в выводе
print('')
ssi=2**(1/2)*rc
sti=3**(1/2)*rc
print(f"Длина стороны вписанного квадрата {int(ssi/100)} м {int(ssi%100)} см")
print(f"Длина стороны правильного вписанного треугольника {int(sti/100)} м {int(sti%100)} см")
print('')
sso=2*rc
sto=2*rc*(3**(1/2))
soo=2*rc*(2**(1/2)-1)
print(f"Длина стороны описанного квадрата {int(sso/100)} м {int(sso%100)} см")
print(f"Длина стороны правильного описанного треугольника {int(sto/100)} м {int(sto%100)} см")
print(f"Длина стороны описанного восьмиугольника {int(soo/100)} м {int(soo%100)} см")